'''Задача 22: Даны два неупорядоченных набора целых чисел (может быть, с повторениями).
Выдать без повторений в порядке возрастания все те числа, которые встречаются в обоих наборах.
Пользователь вводит 2 числа. n - кол-во элементов первого множества. m - кол-во элементов второго множества.
Затем пользователь вводит сами элементы множеств.
11 6
2 4 6 8 10 12 10 8 6 4 2
3 6 9 12 15 18'''


'''n = int(input("Введите количество элементов первого набора чисел: "))

list_1 = list() 
for i in range(n):
    s = int(input("Введите число: "))
    list_1.append(s) 


m = int(input("Введите количество элементов второго набора чисел: "))

list_2 = list() 
for i in range(m):
    c = int(input("Введите число: ")) 
    list_2.append(c) 

list_3 = set(list_1)
list_4 = set(list_2)

list_5 = list_3.union(list_4).difference(list_3.intersection(list_4))

list_end = sorted(list_5)
print(*list_end)'''

'''Задача 24: В фермерском хозяйстве в Карелии выращивают чернику. Она растет на круглой грядке, причем кусты высажены только по окружности. Таким образом, у каждого куста есть ровно два соседних. Всего на грядке растет N кустов.
Эти кусты обладают разной урожайностью, поэтому ко времени сбора на них выросло различное число ягод – на i-ом кусте выросло ai ягод.
В этом фермерском хозяйстве внедрена система автоматического сбора черники. Эта система состоит из управляющего модуля и нескольких собирающих модулей. Собирающий модуль за один заход, находясь непосредственно перед некоторым кустом, собирает ягоды с этого куста и с двух соседних с ним.
Напишите программу для нахождения максимального числа ягод, которое может собрать за один заход собирающий модуль, находясь перед некоторым кустом заданной во входном файле грядки.
4 -> 1 2 3 4
9

5 -> 9 1 2 3 8
20'''

'''n = int(input("Введите кол-во кустов: "))
count = [int(i) for i in input("Введите через пробел кол-во ягод на каждом кусте: ").split()[:n]]
print(max([count[i - 2] + count[i - 1] + count[i] for i in range(n)]))'''

