'''Задача 10: На столе лежат n монеток. Некоторые из них лежат вверх
решкой, а некоторые – гербом. Определите минимальное число
монеток, которые нужно перевернуть, чтобы все монетки были
повернуты вверх одной и той же стороной. Выведите минимальное
количество монет, которые нужно перевернуть.'''
'''5 -> 1 0 1 1 0 
2'''

'''n = int(input("Введите кол-во монеток: "))
count1 = 0
count2 = 0
min_count = 0
for i in range(n):
    l = int(input("Введите орёл-1 или решка-0: "))
    if l==0:
        count1+=1
    elif l==1:
        count2+=1
        if count1<count2:
            min_count=count1
        else:
            min_count=count2
    else:
        min_count=-1
print(f'"{min_count}"')'''

'''Задача 12: Петя и Катя – брат и сестра. Петя – студент, а Катя –
школьница. Петя помогает Кате по математике. Он задумывает два
натуральных числа X и Y (X,Y≤1000), а Катя должна их отгадать. Для
этого Петя делает две подсказки. Он называет сумму этих чисел S и их
произведение P. Помогите Кате отгадать задуманные Петей числа.'''

'''4 4 -> 2 2 
5 6 -> 2 3'''

'''s = int(input("Введите cумму двух чисел: "))
p = int(input("Введите произведение двух чисел: "))
for x in range(s):
    for y in range(s):
        if s == x + y and p == x * y:
            print(f'первое число ="{x}", второе число ="{y}"')'''

'''Задача 14: Требуется вывести все целые степени двойки (т.е. числа вида 2k), не превосходящие числа N.
10 -> 1 2 4 8'''
'''n = int(input("Введите число: "))
i = 0
while 2 ** i <= n:
    print(f' 2 в степени {i} равна {2 ** i}')
    i += 1'''


        
        



 
       
         

       






